wangben85/nRF52832_SDK_16.0_Ben/examples/ble_central_and_peripheral/ble_app_uart_master_slave/main.c
static bool shutdown_handler(nrf_pwr_mgmt_evt_t event);
NRF_PWR_MGMT_HANDLER_REGISTER(shutdown_handler, APP_SHUTDOWN_HANDLER_PRIORITY);

static uint16_t m_ble_nus_max_data_len = BLE_GATT_ATT_MTU_DEFAULT - OPCODE_LENGTH - HANDLE_LENGTH; /**< Maximum length of data (in bytes) that can be transmitted to the peer by the Nordic UART service module. */

/**@brief NUS UUID. */
//static ble_uuid_t const m_nus_uuid =
//{
//    .uuid = BLE_UUID_NUS_SERVICE,
//    .type = NUS_SERVICE_UUID_TYPE
//};
static ble_uuid_t m_adv_uuids[]          =                                          /**< Universally unique service identifier. */
{
    {BLE_UUID_NUS_SERVICE, NUS_SERVICE_UUID_TYPE}
};

// The device lists addr table, which this devices connected to
uint8_t devAddrList[NRF_SDH_BLE_CENTRAL_LINK_COUNT][BLE_GAP_ADDR_LEN] = {{0}};
// The 00:00:00:00:00:00 mac address
uint8_t blankItem[BLE_GAP_ADDR_LEN] = {0};

/**@brief Function for checking if the new connected device already in the device list
 *
 * @param[in]   addr        The new device address which needs to connect.
 * @param[out]  pos         if found the device in the table, return the position index.
 */
bool devaddrListSearch(uint8_t addr[], uint8_t* pos )
{
    uint8_t arraylength = sizeof(devAddrList) / sizeof(devAddrList[0]);
     for ( uint8_t i = 0; i < arraylength; i++ )
        for ( uint8_t j = 0; j < BLE_GAP_ADDR_LEN; j++) 
        {
             if (( devAddrList[i][j] == addr[j]) && (j == BLE_GAP_ADDR_LEN - 1) )
             {
                *pos = i;   // find the item existing ,put the position to pos
                            // and return true
                return true;
             }
             else if ( devAddrList[i][j] != addr[j])
             {
                break;  // no item found, return false
             }
        }
    return false;
}

/**@brief Function for insert a new device into the device list
 *
 * @param[in]   addrInput   The new device address which needs to insert.
 * @param[in]   pos         Insert the position index, which actually is the connection handle index
 */
void devaddrListItemInsert(uint8_t pos, uint8_t addrInput[])
{
   uint8_t dummy;
   if (devaddrListSearch(addrInput,&dummy))
   {
       return;   // do nothing if item already exists  
   }
   else
   {
       memcpy(devAddrList[pos], addrInput, BLE_GAP_ADDR_LEN); 
   }
}

/**@brief Function for Delete the device addr in the device list
 *
 * @param[in]   index   the delete addr index, which actually is the connection handle index.
 */
void devaddrListItemDelete(uint8_t index)
{
   // copy the blankItem addr (00:00:00:00:00:00) into the addr list
   memcpy(devAddrList[index], blankItem, BLE_GAP_ADDR_LEN ); 
}

/**@brief Function for starting advertising.
 */
static void advertising_start(void)
{
    uint32_t err_code = ble_advertising_start(&m_advertising, BLE_ADV_MODE_FAST);
    APP_ERROR_CHECK(err_code);
}

/**@brief Function for handling asserts in the SoftDevice.
 *
 * @details This function is called in case of an assert in the SoftDevice.
 *
 * @warning This handler is only an example and is not meant for the final product. You need to analyze
 *          how your product is supposed to react in case of assert.
 * @warning On assert from the SoftDevice, the system can only recover on reset.
 *
 * @param[in] line_num     Line number of the failing assert call.
 * @param[in] p_file_name  File name of the failing assert call.
 */
void assert_nrf_callback(uint16_t line_num, const uint8_t * p_file_name)
{
    app_error_handler(0xDEADBEEF, line_num, p_file_name);
}


/**@brief Function for handling the Nordic UART Service Client errors.
 *
 * @param[in]   nrf_error   Error code containing information about what went wrong.
 */
static void nus_error_handler(uint32_t nrf_error)
{
    APP_ERROR_HANDLER(nrf_error);
}


/**@brief Function to start scanning. */
static void scan_start(void)
{
    ret_code_t ret;

    ret = nrf_ble_scan_start(&m_scan);
    APP_ERROR_CHECK(ret);

    ret = bsp_indication_set(BSP_INDICATE_SCANNING);
    APP_ERROR_CHECK(ret);
}


/**@brief Function for handling Scanning Module events.
 */
static void scan_evt_handler(scan_evt_t const * p_scan_evt)
{
    ret_code_t err_code;

    //static int devNum = 0;

    switch(p_scan_evt->scan_evt_id)
    {
         case NRF_BLE_SCAN_EVT_CONNECTING_ERROR:
         {
              err_code = p_scan_evt->params.connecting_err.err_code;
              APP_ERROR_CHECK(err_code);
         } break;

         case NRF_BLE_SCAN_EVT_CONNECTED:
         {
             NRF_LOG_INFO("Scaned Devices Connected, implementation in ble_evt_handler.\n");
         } break;

         case NRF_BLE_SCAN_EVT_SCAN_TIMEOUT:
         {
             NRF_LOG_INFO("Scan timed out.");
             scan_start();
         } break;

         default:
             break;
    }
}


/**@brief Function for initializing the scanning and setting the filters.
 */
static void scan_init(void)
{
    ret_code_t          err_code;
    nrf_ble_scan_init_t init_scan;

    memset(&init_scan, 0, sizeof(init_scan));

    init_scan.connect_if_match = true;
    init_scan.conn_cfg_tag     = APP_BLE_CONN_CFG_TAG;

    err_code = nrf_ble_scan_init(&m_scan, &init_scan, scan_evt_handler);
    APP_ERROR_CHECK(err_code);

    //err_code = nrf_ble_scan_filter_set(&m_scan, SCAN_UUID_FILTER, &m_nus_uuid);
    err_code = nrf_ble_scan_filter_set(&m_scan, SCAN_UUID_FILTER, &m_adv_uuids);
    
    APP_ERROR_CHECK(err_code);

    err_code = nrf_ble_scan_filters_enable(&m_scan, NRF_BLE_SCAN_UUID_FILTER, false);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling database discovery events.
 *
 * @details This function is a callback function to handle events from the database discovery module.
 *          Depending on the UUIDs that are discovered, this function forwards the events
 *          to their respective services.
 *
 * @param[in] p_event  Pointer to the database discovery event.
 */
static void db_disc_handler(ble_db_discovery_evt_t * p_evt)
{
//    ble_nus_c_on_db_disc_evt(&m_ble_nus_c, p_evt);
    NRF_LOG_INFO("call to ble_lbs_on_db_disc_evt for link 0x%x!",
                            p_evt->conn_handle);

    ble_nus_c_on_db_disc_evt(&m_ble_nus_c[p_evt->conn_handle], p_evt);
}


/**@brief Function for handling characters received by the Nordic UART Service (NUS).
 *
 * @details This function takes a list of characters of length data_len and prints the characters out on UART.
 *          If @ref ECHOBACK_BLE_UART_DATA is set, the data is sent back to sender.
 */
static void ble_nus_chars_received_uart_print(uint8_t * p_data, uint16_t data_len)
{
    ret_code_t ret_val;

    NRF_LOG_DEBUG("Receiving data.");
    NRF_LOG_HEXDUMP_DEBUG(p_data, data_len);

