wangben85/nRF52832_SDK_16.0_Ben/examples/ble_central_and_peripheral/ble_app_uart_master_slave/main.c
    for (uint32_t i = 0; i < data_len; i++)
    {
        do
        {
            ret_val = app_uart_put(p_data[i]);
            if ((ret_val != NRF_SUCCESS) && (ret_val != NRF_ERROR_BUSY))
            {
                NRF_LOG_ERROR("app_uart_put failed for index 0x%04x.", i);
                APP_ERROR_CHECK(ret_val);
            }
        } while (ret_val == NRF_ERROR_BUSY);
    }
    if (p_data[data_len-1] == '\r')
    {
        while (app_uart_put('\n') == NRF_ERROR_BUSY);
    }
}


/**@brief   Function for handling app_uart events.
 *
 * @details This function receives a single character from the app_uart module and appends it to
 *          a string. The string is sent over BLE when the last character received is a
 *          'new line' '\n' (hex 0x0A) or if the string reaches the maximum data length.
 */
void uart_event_handle(app_uart_evt_t * p_event)
{
    static uint8_t data_array[BLE_NUS_MAX_DATA_LEN];
    static uint16_t index = 0;
    //uint32_t err_code;
    uint32_t ret_val;
    // get the device role : central or peripheral
    ble_conn_state_conn_handle_list_t conn_handles = ble_conn_state_periph_handles();

    switch (p_event->evt_type)
    {
        /**@snippet [Handling data from UART] */
        case APP_UART_DATA_READY:
            UNUSED_VARIABLE(app_uart_get(&data_array[index]));
            index++;

            if ((data_array[index - 1] == '\n') ||
                (data_array[index - 1] == '\r') ||
                (index >= (m_ble_nus_max_data_len)))
            {
                NRF_LOG_DEBUG("Ready to send data over BLE NUS");
                NRF_LOG_HEXDUMP_DEBUG(data_array, index);
                do
                {
                   // master(central) send to all connected slaves(peripherals)
                   for (uint8_t i = 0; i < ble_conn_state_central_conn_count(); i++) 
                   {
                        NRF_LOG_INFO("Central node sent to the peripheral connection handle 0x%04x.\n",i);
                        ret_val = ble_nus_c_string_send(&m_ble_nus_c[i], data_array, index); 
                        if ( (ret_val != NRF_ERROR_INVALID_STATE) && (ret_val != NRF_ERROR_RESOURCES) )
                        {
                            APP_ERROR_CHECK(ret_val);
                        }
                   }  

					    // slave send to all connected masters
                   for (uint8_t i = 0; i < conn_handles.len; i++) 
                   {
                        NRF_LOG_INFO("Sent on connection handle 0x%04x.\n", conn_handles.conn_handles[i]); 
                        ret_val = ble_nus_data_send(&m_nus, data_array, &index, conn_handles.conn_handles[i]); 
                        if ((ret_val != NRF_ERROR_INVALID_STATE) &&
                            (ret_val != NRF_ERROR_RESOURCES) &&
                            (ret_val != NRF_ERROR_NOT_FOUND))
                        {
                            APP_ERROR_CHECK(ret_val);
                        }
                   } 						 
                } while (ret_val == NRF_ERROR_RESOURCES);

                index = 0;
            }

            break;

        /**@snippet [Handling data from UART] */
        case APP_UART_COMMUNICATION_ERROR:
            NRF_LOG_ERROR("Communication error occurred while handling UART.");
            APP_ERROR_HANDLER(p_event->data.error_communication);
            break;

        case APP_UART_FIFO_ERROR:
            NRF_LOG_ERROR("Error occurred in FIFO module used by UART.");
            APP_ERROR_HANDLER(p_event->data.error_code);
            break;

        default:
            break;
    }
}


/**@brief Callback handling Nordic UART Service (NUS) client events.
 *
 * @details This function is called to notify the application of NUS client events.
 *
 * @param[in]   p_ble_nus_c   NUS client handle. This identifies the NUS client.
 * @param[in]   p_ble_nus_evt Pointer to the NUS client event.
 */

/**@snippet [Handling events from the ble_nus_c module] */
static void ble_nus_c_evt_handler(ble_nus_c_t * p_ble_nus_c, ble_nus_c_evt_t const * p_ble_nus_evt)
{
    ret_code_t err_code;

    switch (p_ble_nus_evt->evt_type)
    {
        case BLE_NUS_C_EVT_DISCOVERY_COMPLETE: // master find device and service
            NRF_LOG_INFO("Discovery complete.");
            err_code = ble_nus_c_handles_assign(p_ble_nus_c, p_ble_nus_evt->conn_handle, &p_ble_nus_evt->handles);
            APP_ERROR_CHECK(err_code);

            err_code = ble_nus_c_tx_notif_enable(p_ble_nus_c);
            APP_ERROR_CHECK(err_code);
            NRF_LOG_INFO("Connected to device with Nordic UART Service.");
            break;

        case BLE_NUS_C_EVT_NUS_TX_EVT: // Event indicating that the central received something from a peer. 
            ble_nus_chars_received_uart_print(p_ble_nus_evt->p_data, p_ble_nus_evt->data_len);
            break;

        case BLE_NUS_C_EVT_DISCONNECTED:
            NRF_LOG_INFO("Disconnected.");
            scan_start();
            break;
    }
}
/**@snippet [Handling events from the ble_nus_c module] */


/**
 * @brief Function for handling shutdown events.
 *
 * @param[in]   event       Shutdown type.
 */
static bool shutdown_handler(nrf_pwr_mgmt_evt_t event)
{
    ret_code_t err_code;

    err_code = bsp_indication_set(BSP_INDICATE_IDLE);
    APP_ERROR_CHECK(err_code);

    switch (event)
    {
        case NRF_PWR_MGMT_EVT_PREPARE_WAKEUP:
            // Prepare wakeup buttons.
            err_code = bsp_btn_ble_sleep_mode_prepare();
            APP_ERROR_CHECK(err_code);
            break;

        default:
            break;
    }

    return true;
}


/**@brief Function for advertising restart.
 */
static void advertising_restart(void)
{
    ret_code_t err_code;

    err_code = sd_ble_gap_adv_start(m_advertising.adv_handle, APP_BLE_CONN_CFG_TAG);

    APP_ERROR_CHECK(err_code);
}

#if 0
/**@brief Function for advertising stop.
 */
static void advertising_stop(void)
{
    ret_code_t err_code;

    err_code = sd_ble_gap_adv_stop(m_advertising.adv_handle);

    APP_ERROR_CHECK(err_code);
}
#endif

/**@brief Function for handling BLE events.
 *
 * @param[in]   p_ble_evt   Bluetooth stack event.
 * @param[in]   p_context   Unused.
 */
static void ble_evt_handler(ble_evt_t const * p_ble_evt, void * p_context)
{
    ret_code_t            err_code;
    ble_gap_evt_t const * p_gap_evt = &p_ble_evt->evt.gap_evt;
    //querying the role of the local device in a connection
    uint16_t role        = ble_conn_state_role(p_gap_evt->conn_handle);
    uint32_t periph_link_cnt = ble_conn_state_peripheral_conn_count();

    switch (p_ble_evt->header.evt_id)
    {
        case BLE_GAP_EVT_CONNECTED: 
        if ( role == BLE_GAP_ROLE_CENTRAL )  // device role is central
		{
            NRF_LOG_INFO("Connection 0x%x established, starting DB discovery.",
                         p_gap_evt->conn_handle);
            APP_ERROR_CHECK_BOOL(p_gap_evt->conn_handle < NRF_SDH_BLE_CENTRAL_LINK_COUNT);
            NRF_LOG_INFO("Connecting to target No.%d",p_gap_evt->conn_handle);
            // add the connected device into device list(table)
            devaddrListItemInsert(p_gap_evt->conn_handle, (uint8_t* )p_gap_evt->params.connected.peer_addr.addr);
            NRF_LOG_INFO("Connected slave address is  %02x%02x%02x%02x%02x%02x",
                      p_gap_evt->params.connected.peer_addr.addr[0],
                      p_gap_evt->params.connected.peer_addr.addr[1],
                      p_gap_evt->params.connected.peer_addr.addr[2],
                      p_gap_evt->params.connected.peer_addr.addr[3],
                      p_gap_evt->params.connected.peer_addr.addr[4],
                      p_gap_evt->params.connected.peer_addr.addr[5]
                      );
            
            m_conn_handle_central = p_gap_evt->conn_handle;
            err_code = ble_nus_c_handles_assign(&m_ble_nus_c[m_conn_handle_central],//m_ble_nus_c[0], m_ble_nus_c[1]...m_ble_nus_c[7]
                                                m_conn_handle_central, // assign the connection handle
                                                NULL); //NULL, actually RX and Tx characteristics nothing to assgin
            APP_ERROR_CHECK(err_code);

            err_code = bsp_indication_set(BSP_INDICATE_CONNECTED);
            APP_ERROR_CHECK(err_code);

            // start discovery of services. The NUS Client waits for a discovery result
            err_code = ble_db_discovery_start(&m_db_disc[m_conn_handle_central],//m_db_disc[0],m_db_disc[1],...m_db_disc[7],
                                              m_conn_handle_central);// find the connection handle, and do discovery
            APP_ERROR_CHECK(err_code);

            // Central connected peripheral devices reach to Max 
            if (ble_conn_state_central_conn_count() == NRF_SDH_BLE_CENTRAL_LINK_COUNT)
            {
                // no longer scan when the peripheral links reach the max
            }
            else
            {
                scan_start();
            }
		}

        else if ( role == BLE_GAP_ROLE_PERIPH )   // device role is peripheral
        {
            NRF_LOG_INFO("Connection with link 0x%x established.\n", p_ble_evt->evt.gap_evt.conn_handle); 
            err_code = bsp_indication_set(BSP_INDICATE_CONNECTED);
            APP_ERROR_CHECK(err_code);
            m_conn_handle_peripheral = p_gap_evt->conn_handle;
            // Assign connection handle to available instance of QWR module.
            for (uint32_t i = 0; i < NRF_SDH_BLE_PERIPHERAL_LINK_COUNT; i++)
            {
              if (m_qwr[i].conn_handle == BLE_CONN_HANDLE_INVALID)
              {
                err_code = nrf_ble_qwr_conn_handle_assign(&m_qwr[i], m_conn_handle_peripheral);
                APP_ERROR_CHECK(err_code);
                break;
              }
            }
            if (ble_conn_state_peripheral_conn_count() == NRF_SDH_BLE_PERIPHERAL_LINK_COUNT) 
            {
               // the maximum link count has not been reached, not advertising any more
               //advertising_stop();
            }
            else
            {
               // Continue advertising. More connections can be established because the maximum link count has not been reached.
               advertising_restart();
            } 			  
			  }
            break;

        case BLE_GAP_EVT_DISCONNECTED:

            if ( role == BLE_GAP_ROLE_CENTRAL )  // device role is central
            {
              NRF_LOG_INFO("Disconnected. conn_handle: 0x%x, reason: 0x%x",
                         p_gap_evt->conn_handle,
                         p_gap_evt->params.disconnected.reason);

              // continue scanning after disconnected.
              scan_start();
            }
			
